---
kind: property
id: P:Autodesk.Revit.DB.ImageTypeOptions.Path
source: html/322a4a54-839e-f1f4-68ad-7c6194d1c215.htm
---
# Autodesk.Revit.DB.ImageTypeOptions.Path Property

The path of the file that specifies the image to be used.

## Syntax (C#)
```csharp
public string Path { get; }
```